The figure shows an example topology where the NAT configuration allows translation for all hosts on the 192.168.0.0/16 network. This includes the 192.168.10.0 and 192.168.11.0 LANs when the hosts generate traffic that enters interface S0/1/0 and exits S0/1/1. The host inside local addresses are translated to an available pool address in the range of 209.165.200.226 to209.165.200.240.

![[6.5.2.png]]

````tabs
tab: Step 1
**Step 1**
<br/><br/>
Define the pool of addresses that will be used for translation using the **ip nat pool** command. This pool of addresses is typically a group of public addresses. The addresses are defined by indicating the starting IPv4 address and the ending IPv4 address of the pool. The **netmask** or **prefix-length** keyword indicates which address bits belong to the network and which bits belong to the host for that range of addresses.
<br/><br/>
In the scenario, define a pool of public IPv4 addresses under the pool name NAT-POOL1.
<br/><br/>
```
R2(config)# ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224
```

tab: Step 2
**Step 2**
<br/><br/>
Configure a standard ACL to identify (permit) only those addresses that are to be translated. An ACL that is too permissive can lead to unpredictable results. Remember there is an implicit **deny all** statement at the end of each ACL.
<br/><br/>
In the scenario, define which addresses are eligible to be translated.
<br/><br/>
```
R2(config)# access-list 1 permit 192.168.0.0 0.0.255.255
```

tab: Step 3
**Step 3**
<br/><br/>
Bind the ACL to the pool, using the following command syntax:
<br/><br/>
Router(config)# **ip nat inside source list** {_access-list-number_ | _access-list-name_} **pool** _pool-name_
<br/><br/>
This configuration is used by the router to identify which devices (**list**) receive which addresses (**pool**). In the scenario, bind NAT-POOL1 with ACL 1.
<br/><br/>
```
R2(config)# ip nat inside source list 1 pool NAT-POOL1
```

tab: Step 4
**Step 4**
<br/><br/>
Identify which interfaces are inside, in relation to NAT; this will be any interface that connects to the inside network.
<br/><br/>
In the scenario, identify interface serial 0/1/0 as an inside NAT interface.
<br/><br/>
```
R2(config)# interface serial 0/1/0
R2(config-if)# ip nat inside
```

tab: Step 5
**Step 5**
<br/><br/>
Identify which interfaces are outside, in relation to NAT; this will be any interface that connects to the outside network.
<br/><br/>
In the scenario, identify interface serial 0/1/1 as the outside NAT interface.
<br/><br/>
```
R2(config)# interface serial 0/1/1
R2(config-if)# ip nat outside
```
````
