The output of the **show ip nat translations** command displays all static translations that have been configured and any dynamic translations that have been created by traffic.

```
R2# show ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
--- 209.165.200.228    192.168.10.10      ---                ---
--- 209.165.200.229    192.168.11.10      ---                ---
R2#
```

Adding the **verbose** keyword displays additional information about each translation, including how long ago the entry was created and used.

```
R2# show ip nat translation verbose
Pro Inside global      Inside local       Outside local      Outside global
tcp 209.165.200.228    192.168.10.10      ---                ---
    create 00:02:11, use 00:02:11 timeout:86400000, left 23:57:48, Map-Id(In): 1, 
    flags: 
none, use_count: 0, entry-id: 10, lc_entries: 0
tcp 209.165.200.229    192.168.11.10      ---                ---
    create 00:02:10, use 00:02:10 timeout:86400000, left 23:57:49, Map-Id(In): 1, 
    flags: 
none, use_count: 0, entry-id: 12, lc_entries: 0
R2#
```

By default, translation entries time out after 24 hours, unless the timers have been reconfigured with the **ip nat translation timeout** _timeout-seconds_ command in global configuration mode.

To clear dynamic entries before the timeout has expired, use the **clear ip nat translation** privileged EXEC mode command as shown.

R2# **clear ip nat translation ***
R2# **show ip nat translation**

It is useful to clear the dynamic entries when testing the NAT configuration. The **clear ip nat translation** command can be used with keywords and variables to control which entries are cleared, as shown in the table. Specific entries can be cleared to avoid disrupting active sessions. Use the **clear ip nat translation *** privileged EXEC command to clear all translations from the table.

| **Command**                                                                                                                                               | **Description**                                                                                                    |
| --------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------ |
| **clear ip nat translation ***                                                                                                                            | Clears all dynamic address translation entries from the NAT translation table.                                     |
| **clear ip nat translation inside** _global-ip local-ip_ [**outside** _local-ip global-ip_]                                                               | Clears a simple dynamic translation entry containing an inside translation or both inside and outside translation. |
| **clear ip nat translation** _protocol_ **inside** _global-ip global-port local-ip local-port_ [ **outside** _local-ip local-port global-ip global-port_] | Clears an extended dynamic translation entry.                                                                      |

**Note**: Only the dynamic translations are cleared from the table. Static translations cannot be cleared from the translation table.

Another useful command, **show ip nat statistics**, displays information about the total number of active translations, NAT configuration parameters, the number of addresses in the pool, and how many of the addresses have been allocated.

```
R2# show ip nat statistics 
Total active translations: 4 (0 static, 4 dynamic; 0 extended)
Peak translations: 4, occurred 00:31:43 ago
Outside interfaces:
  Serial0/1/1
Inside interfaces: 
  Serial0/1/0
Hits: 47  Misses: 0
CEF Translated packets: 47, CEF Punted packets: 0
Expired translations: 5
Dynamic mappings:
-- Inside Source
[Id: 1] access-list 1 pool NAT-POOL1 refcount 4
 pool NAT-POOL1: netmask 255.255.255.224
	start 209.165.200.226 end 209.165.200.240
	type generic, total addresses 15, allocated 2 (13%), misses 0
(output omitted)
R2#
```

Alternatively, you can use the **show running-config** command and look for NAT, ACL, interface, or pool commands with the required values. Examine these carefully and correct any errors discovered. The example shows the NAT pool configuration.

```
R2# show running-config | include NAT
ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224
ip nat inside source list 1 pool NAT-POOL1
```