The topology in the figure will be used to demonstrate configuring and applying numbered and named standard IPv4 ACLs to an interface. This first example shows a numbered standard IPv4 ACL implementation.

![[5.1.5.png]]

Assume only PC1 is allowed out to the internet. To enable this policy, a standard ACL ACE could be applied outbound on S0/1/0, as shown in the figure.

```
R1(config)# access-list 10 remark ACE permits ONLY host 192.168.10.10 to the internet
R1(config)# access-list 10 permit host 192.168.10.10
R1(config)# do show access-lists
Standard IP access list 10    
	10 permit 192.168.10.10
R1(config)#
```

Notice that the output of the **show access-lists** command does not display the **remark** statements. ACL remarks are displayed in the running configuration file. Although the **remark** command is not required to enable the ACL, it is strongly suggested for documentation purposes.

Now assume that a new network policy states that hosts in LAN 2 should also be permitted to the internet. To enable this policy, a second standard ACL ACE could be added to ACL 10, as shown in the output.

```
R1(config)# access-list 10 remark ACE permits all host in LAN 2
R1(config)# access-list 10 permit 192.168.20.0 0.0.0.255
R1(config)# do show access-lists
Standard IP access list 10    
	10 permit 192.168.10.10    
	20 permit 192.168.20.0, wildcard bits 0.0.0.255
R1(config)#
```

Apply ACL 10 outbound on the Serial 0/1/0 interface.

```
R1(config)# interface Serial 0/1/0
R1(config-if)# ip access-group 10 out
R1(config-if)# end
R1#
```

The resulting policy of ACL 10 will only permit host 192.168.10.10 and all host from LAN 2 to exit the Serial 0/1/0 interface. All other hosts in the 192.168.10.0 network will not be permitted to the internet.

Use the **show running-config** command to review the ACL in the configuration, as shown in the output.

```
R1# show run | section access-list
access-list 10 remark ACE permits host 192.168.10.10
access-list 10 permit 192.168.10.10
access-list 10 remark ACE permits all host in LAN 2
access-list 10 permit 192.168.20.0 0.0.0.255
R1#
```

Notice how the **remarks** statements are also displayed.

Finally, use the **show ip interface** command to verify if an interface has an ACL applied to it. In the example output, the output is specifically looking at the Serial 0/1/0 interface for lines that include “access list” text.

```
R1# show ip int Serial 0/1/0 | include access list  
	Outgoing Common access list is not set  
	Outgoing access list is 10  
	Inbound Common access list is not set  
	Inbound  access list is not set
R1#
```
