Before configuring SSH, the switch must be minimally configured with a unique hostname and the correct network connectivity settings.

````tabs
tab: Step 1
**Step 1**
<br/>
**Verify SSH support.**
<br/>
Use the **show ip ssh** command to verify that the switch supports SSH. If the switch is not running an IOS that supports cryptographic features, this command is unrecognized. 
<br/>

```
S1# show ip ssh
```

tab: Step 2
**Step 2**
<br/>
**Configure the IP domain.**
<br/>
Configure the IP domain name of the network using the **ip domain-name** _domain-name_ global configuration mode command. In the figure, the _domain-name_ value is **[cisco.com](http://cisco.com)**.
<br/>
```
S1(config)# ip domain-name cisco.com
```

tab: Step 3
**Step 3**
<br/>
**Generate RSA key pairs.**
<br/>
Not all versions of the IOS default to SSH version 2, and SSH version 1 has known security flaws. To configure SSH version 2, issue the **ip ssh version 2** global configuration mode command. Generating an RSA key pair automatically enables SSH. Use the **crypto key generate rsa** global configuration mode command to enable the SSH server on the switch and generate an RSA key pair. When generating RSA keys, the administrator is prompted to enter a modulus length. The sample configuration in the figure uses a modulus size of 1,024 bits. A longer modulus length is more secure, but it takes longer to generate and to use.
<br/>
**Note:** To delete the RSA key pair, use the **crypto key zeroize rsa** global configuration mode command. After the RSA key pair is deleted, the SSH server is automatically disabled.
<br/>
```
S1(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
```

tab: Step 4
**Step 4**
<br/>
**Configure user authentication.**
<br/>
The SSH server can authenticate users locally or using an authentication server. To use the local authentication method, create a username and password pair using the **username** _username_ **secret** _password_ global configuration mode command. In the example, the user admin is assigned the password ccna.
<br/>
```
S1(config)# username admin secret ccna
```

tab: Step 5
**Step 5**
<br/>
**Configure the vty lines.**
<br/>
Enable the SSH protocol on the vty lines by using the **transport input ssh** line configuration mode command. The Catalyst 2960 has vty lines ranging from 0 to 15. This configuration prevents non-SSH (such as Telnet) connections and limits the switch to accept only SSH connections. Use the **line vty** global configuration mode command and then the **login local** line configuration mode command to require local authentication for SSH connections from the local username database.
<br/>
```
S1(config)# line vty 0 15
S1(config-line)# transport input ssh
S1(config-line)# login local
S1(config-line)# exit
```

tab: Step 6
**Step 6**
<br/>
**Enable SSH version 2.**
<br/>
By default, SSH supports both versions 1 and 2. When supporting both versions, this is shown in the **show ip ssh** output as supporting version 2. Enable SSH version using the **ip ssh version 2** global configuration command.
<br/>
```
S1(config)# ip ssh version 2
```

````